p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/mscuser.cpp
/*
 *  MSC Set Command Status Wrapper Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_SetCSW (void) {

  BulkStage = MSC_BS_CSW;
  CSW.dSignature = MSC_CSW_Signature;
  // Stall endpoint if required see: http://www.usb.org/developers/docs/devclass_docs/usbmassbulk_10.pdf
  if (CSW.dDataResidue != 0) {
    _DBG("Stall data residue "); _DBD32(CBW.CB[0]); _DBG("\n");
    if ((CBW.bmFlags & 0x80) == 0) {
      MSC_StallEP(MSC_EP_OUT);
    }
    else {
      MSC_StallEP(MSC_EP_IN);
    }
  }
  if (CSW.bStatus == CSW_PHASE_ERROR) {
    MSC_StallEP(MSC_EP_IN);
  }

  //USB_WriteEP(MSC_EP_IN, (uint8_t *)&CSW, sizeof(CSW));
  for(int i = 0; i < sizeof(CSW); i++)
    BulkBuf[i] = ((uint8_t *)&CSW)[i];
    //MSC_QueueDMAWrite((uint8_t *)&CSW, sizeof(CSW), true);
    MSC_QueueDMAIO(MSC_EP_IN, BulkBuf, sizeof(CSW));

}


/*
 *  MSC Bulk In Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_BulkIn (void) {
  uint32_t n;
  //_DBG("Bulkin "); _DBH(BulkStage); _DBG("\n");
  switch (BulkStage) {
    case MSC_BS_DATA_IN:
      switch (CBW.CB[0]) {
        case SCSI_READ10:
          MSC_MemoryRead();
          break;
      }
      break;
    case MSC_BS_DATA_LAST:
      //USB_DMA_Disable(MSC_EP_IN);
      MSC_SetCSW();
      break;
    case MSC_BS_CSW:
      BulkStage = MSC_BS_CBW;
      USB_DMA_Trigger(MSC_EP_OUT);
      break;
  }
}


/*
 *  MSC Bulk Out Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_BulkOut (void) {
  BulkLen = USB_DMA_BufCnt(MSC_EP_OUT);
  //_DBG("Bulkout "); _DBH(BulkStage); _DBG("\n");
  switch (BulkStage) {
    case MSC_BS_CBW:
      MSC_GetCBW();
      break;
    case MSC_BS_DATA_OUT:
      switch (CBW.CB[0]) {
        case SCSI_WRITE10:
          MSC_MemoryWrite();
          break;
        case SCSI_VERIFY10:
          MSC_MemoryVerify();
          break;
        default:
        _DBG("unexpected op "); _DBD32(CBW.CB[0]); _DBG("\n");
      }
      break;
    default:
      _DBG("BO Phase error ");_DBD32(BulkStage); _DBG("\n");
      _DBG("Data len "); _DBD32(BulkLen); _DBG("\n");
      MSC_StallEP(MSC_EP_OUT);
      CSW.bStatus = CSW_PHASE_ERROR;
      MSC_SetCSW();
      break;
  }
}

void MSC_DMA (uint32_t event) {
  //_DBG("DMA event "); _DBD32(event); _DBG(" "); _DBD32(USB_DMA_Status(MSC_EP_IN)); _DBG("\n");

  switch(event) {
    case USB_EVT_IN_DMA_EOT:
      if (BulkStage == MSC_BS_DATA_IN) {
        //_DBG("EOT "); _DBD32(BufferOut); _DBG("\n");
        BufferContent[BufferOut] = BUFFER_EMPTY;
        BufferOut = (BufferOut + 1) % MSC_IO_BUFFERS;
      }
      break;
    case USB_EVT_IN_DMA_NDR:
      //USB_DMA_Disable(MSC_EP_IN);
      MSC_BulkIn();
      break;
    case USB_EVT_IN_DMA_ERR:
      _DBG("Error in "); _DBD32(USB_DMA_Status(MSC_EP_IN)); _DBG("\n");
      break;
    case USB_EVT_OUT_DMA_EOT:
      MSC_BulkOut();
      break;
    case USB_EVT_OUT_DMA_NDR:
      switch(BulkStage) {
        case MSC_BS_DATA_OUT:
          if (BufferContent[BufferIn] == BUFFER_EMPTY)
            MSC_QueueDMAIO(MSC_EP_OUT, Buffers[BufferIn], MSC_BLOCK_SIZE);
          else
            wwcnt++;
          break;
        case MSC_BS_CBW:
          //MSC_QueueDMAIO(MSC_EP_OUT, (uint8_t *)&CBW, sizeof(CBW));
          MSC_QueueDMAIO(MSC_EP_OUT, BulkBuf, sizeof(CBW));
          break;
        default:
          _DBG("Unexpected state "); _DBD32(BulkStage); _DBG("\n");
          break;
      }
      break;
    case USB_EVT_OUT_DMA_ERR:
      _DBG("Error out "); _DBD32(USB_DMA_Status(MSC_EP_OUT)); _DBG("\n");
      break;
  }
  //_DBG("End event "); _DBD32(event); _DBG("\n");
}
